from decimal import Decimal


def numbers_to_words(number):
    if number > 999999.99:
        exit('Max value is 999999.99')
    units_dict = {
        0: '',
        1: 'одна гривня',
        2: 'дві гривні',
        3: 'три гривні',
        4: 'чотири гривні',
        5: 'п\'ять гривень',
        6: 'шість гривень',
        7: 'сім гривень',
        8: 'вісім гривень',
        9: 'дев\'ять гривень',
    }
    tens_dict = {
        0: '',
        10: 'десять гривень',
        11: 'одинадцять гривень',
        12: 'дванадцять гривень',
        13: 'тринадцять гривень',
        14: 'чотирнадцять гривень',
        15: 'п\'ятнадцять гривень',
        16: 'шістнадцять гривень',
        17: 'сімнадцять гривень',
        18: 'вісімнадцять гривень',
        19: 'дев\'ятнадцять гривень',
        20: 'двадцять',
        30: 'тридцять',
        40: 'сорок',
        50: 'п\'ятдесят',
        60: 'шістдесят',
        70: 'сімдесят',
        80: 'вісімдесят',
        90: 'дев\'яносто',
    }
    hundreds_dict = {
        0: '',
        100: 'сто',
        200: 'двісті',
        300: 'триста',
        400: 'чотириста',
        500: 'п\'ятсот',
        600: 'шістсот',
        700: 'сімсот',
        800: 'вісімсот',
        900: 'дев\'ятсот',
    }
    thousands_dict = {
        0: 'тисяч',
        1000: 'одна тисяча',
        2000: 'дві тисячі',
        3000: 'три тисячі',
        4000: 'чотири тисячі',
        5000: 'п\'ять тисяч',
        6000: 'шість тисяч',
        7000: 'сім тисяч',
        8000: 'вісім тисяч',
        9000: 'дев\'ять тисяч',
    }
    tens_thousands_dict = {
        0: '',
        10000: 'десять',
        11000: 'одинадцять',
        12000: 'дванадцять',
        13000: 'тринадцять',
        14000: 'чотирнадцять',
        15000: 'п\'ятнадцять',
        16000: 'шістнадцять',
        17000: 'сімнадцять',
        18000: 'вісімнадцять',
        19000: 'дев\'ятнадцять',
        20000: 'двадцять',
        30000: 'тридцять',
        40000: 'сорок',
        50000: 'п\'ятдесят',
        60000: 'шістдесят',
        70000: 'сімдесят',
        80000: 'вісімдесят',
        90000: 'дев\'яносто',
    }
    hundreds_thousands_dict = {
        0: '',
        100000: 'сто',
        200000: 'двісті',
        300000: 'триста',
        400000: 'чотириста',
        500000: 'п\'ятсот',
        600000: 'шістсот',
        700000: 'сімсот',
        800000: 'вісімсот',
        900000: 'дев\'ятсот',
    }
    unit = int(number % 10)
    ten = int((number % 100) - unit)
    h = int((number % 1000) - ten - unit)
    t = int((number % 10000) - h - ten - unit)
    ten_t = int((number % 100000) - t - h - ten - unit)
    h_t = int((number % 1000000) - ten_t - t - h - ten - unit)
    c = str(Decimal(str(number)) % 1)[2:]
    if ten == 10:
        ten += unit
        unit = 0
    if ten_t == 10000:
        ten_t += t
        t = 0
    result = ''
    if h_t != 0 or ten_t != 0 or t != 0:
        result += hundreds_thousands_dict[h_t] + ' ' + tens_thousands_dict[ten_t] + ' ' + thousands_dict[t] + ' ' + \
                  hundreds_dict[h] + ' ' + \
                  tens_dict[ten] + ' ' + units_dict[unit] + ' ' + c + ' копійок'

    else:
        result += hundreds_dict[h] + ' ' + tens_dict[ten] + ' ' + units_dict[unit] + ' ' + c + ' копійок'
    return result


try:
    num = float(input('Enter number: '))
    print(numbers_to_words(num))
except ValueError:
    exit('Please enter correct number!!!')
